gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_skynet/Hardware/NET/net_nbiot_app.c
/**
  *********************************************************************************************************
  * @file    net_nbiot_app.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2018-04-26
  * @brief   
  *********************************************************************************************************
  * @attention
  *
  *
  *
  *********************************************************************************************************
  */

#include "net_nbiot_app.h"
#include "net_coap_app.h"
#include "net_pcp_app.h"
#include "net_dns_app.h"
#include "net_mqttsn_app.h"
#include "net_mqttsn_pcp_app.h"
#include "net_onenet_app.h"
#include "net_udp_app.h"
#include "stm32l1xx_config.h"
#include "platform_config.h"
#include "platform_map.h"
#include "inspectmessageoperate.h"
#include "hal_rtc.h"
#include "radar_api.h"
#include "string.h"

NETCoapNeedSendCodeTypeDef	NETCoapNeedSendCode = NETCoapNeedSendCode_initializer;
NETMqttSNNeedSendCodeTypeDef	NETMqttSNNeedSendCode = NETMqttSNNeedSendCode_initializer;
NETOneNETNeedSendCodeTypeDef	NETOneNETNeedSendCode = NETOneNETNeedSendCode_initializer;

/**********************************************************************************************************
 @Function			void NET_NBIOT_FIFOMessage_Initialization(void)
 @Description			NET_NBIOT_FIFOMessage_Initialization			: NET数据缓存初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_FIFOMessage_Initialization(void)
{
#ifndef NETPROTOCAL
	#error No Define NETPROTOCAL!
#else
#if (NETPROTOCAL == NETCOAP)
	
	/* NBIOT发送数据FIFO初始化 */
	NET_Coap_FifoSendMessageInit();
	/* NBIOT接收数据FIFO初始化 */
	NET_Coap_FifoRecvMessageInit();
	
	/* PCP发送数据FIFO初始化 */
	NET_PCP_FifoSendMessageInit();
	/* PCP接收数据FIFO初始化 */
	NET_PCP_FifoRecvMessageInit();
	
#elif (NETPROTOCAL == NETMQTTSN)
	
	/* MqttSN发送数据FIFO初始化 */
	NET_MqttSN_FifoSendMessageInit();
	
	/* MQTTSN PCP发送数据FIFO初始化 */
	NET_MqttSN_PCP_FifoSendMessageInit();
	/* MQTTSN PCP接收数据FIFO初始化 */
	NET_MqttSN_PCP_FifoRecvMessageInit();
	
	/* UDP发送数据FIFO初始化 */
	NET_UDP_FifoSendMessageInit();
	/* UDP接收数据FIFO初始化 */
	NET_UDP_FifoRecvMessageInit();
	
#elif (NETPROTOCAL == NETONENET)
	
	/* ONENET发送数据FIFO初始化 */
	NET_OneNET_FifoSendMessageInit();
	/* ONENET接收数据FIFO初始化 */
	NET_OneNET_FifoRecvMessageInit();
	
#else
	#error NETPROTOCAL Define Error
#endif
#endif
}

/**********************************************************************************************************
 @Function			void NET_NBIOT_Initialization(void)
 @Description			NET_NBIOT_Initialization						: NET初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_Initialization(void)
{
	/* NET NBIOT客户端初始化 */
	NET_NBIOT_Client_Init(&NetNbiotClientHandler);
	/* NET NBIOT数据缓存初始化 */
	NET_NBIOT_FIFOMessage_Initialization();
	
	/* NBIOT数据传输接口初始化 */
	NBIOT_Transport_Init(&NbiotATCmdHandler);
	/* NBIOT客户端初始化 */
	NBIOT_Client_Init(&NbiotClientHandler, &NbiotATCmdHandler, &NetNbiotClientHandler);
	
#ifndef NETPROTOCAL
	#error No Define NETPROTOCAL!
#else
#if (NETPROTOCAL == NETCOAP)
	
	/* PCP数据传输接口初始化 */
	PCP_Transport_Init(&PCPCoAPNetHandler, &NbiotClientHandler);
	/* PCP客户端初始化 */
	PCP_Client_Init(&PCPClientHandler, &PCPCoAPNetHandler, &NetNbiotClientHandler);
	
#elif (NETPROTOCAL == NETMQTTSN)
	
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
	/* DNS数据传输接口初始化 */
	DNS_Transport_Init(&DNSSocketNetHandler, &NbiotClientHandler, DNS_SERVER_LOCAL_PORT, DNS_SERVER_HOST_IP, DNS_SERVER_TELE_PORT);
	/* DNS客户端初始化 */
	DNS_Client_Init(&DNSClientHandler, &DNSSocketNetHandler, &NetNbiotClientHandler);
#endif
	
	/* MqttSN数据传输接口初始化 */
	MQTTSN_Transport_Init(&MqttSNSocketNetHandler, &NbiotClientHandler, MQTTSN_SERVER_LOCAL_PORT, MQTTSN_SERVER_HOST_IP, MQTTSN_SERVER_TELE_PORT);
	/* MQTTSN客户端初始化 */
	MQTTSN_Client_Init(&MqttSNClientHandler, &MqttSNSocketNetHandler, &NetNbiotClientHandler);
	
	/* MQTTSN PCP数据传输接口初始化 */
	MqttPCP_Transport_Init(&MqttSNPCPMqttNetHandler, &MqttSNClientHandler);
	/* MQTTSN PCP客户端初始化 */
	MqttPCP_Client_Init(&MqttSNPCPClientHandler, &MqttSNPCPMqttNetHandler, &NetNbiotClientHandler);
	
	/* UDP数据传输接口初始化 */
	UDP_Transport_Init(&UDPSocketNetHandler, &NbiotClientHandler, UDP_SERVER_LOCAL_PORT, TCFG_EEPROM_Get_UDPIP_String(), TCFG_EEPROM_GetUDPPort());
	/* UDP客户端初始化 */
	UDP_Client_Init(&UDPClientHandler, &UDPSocketNetHandler, &NetNbiotClientHandler);
	
#elif (NETPROTOCAL == NETONENET)
	
	/* ONENET数据传输接口初始化 */
	ONENET_Transport_Init(&OneNETLWM2MNetHandler, &NbiotClientHandler);
	/* ONENET客户端初始化 */
	OneNET_Client_Init(&OneNETClientHandler, &OneNETLWM2MNetHandler, &NetNbiotClientHandler);
	
#else
	#error NETPROTOCAL Define Error
#endif
#endif
}

/**********************************************************************************************************
 @Function			void NET_NBIOT_Client_Init(NET_NBIOT_ClientsTypeDef* pClient)
 @Description			NET_NBIOT_Client_Init					: 初始化NET NBIOT客户端
 @Input				pClient								: NET NBIOT客户端实例
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_Client_Init(NET_NBIOT_ClientsTypeDef* pClient)
{
#if NETPROTOCAL == NETCOAP
	
	pClient->PollExecution								= NET_POLL_EXECUTION_COAP;
	
#elif NETPROTOCAL == NETMQTTSN
	
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_DISABLE
	pClient->PollExecution								= NET_POLL_EXECUTION_MQTTSN;
#endif
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
	pClient->PollExecution								= NET_POLL_EXECUTION_DNS;
#endif
	
#elif NETPROTOCAL == NETONENET
	
	pClient->PollExecution								= NET_POLL_EXECUTION_ONENET;
	
#endif
}

#if NETPROTOCAL == NETCOAP
void NET_NBIOT_CoapShortStructureInit(void)
{
	CoapShortStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CoapShortStructure.HeadPacket.DataLen					= 0x00;
	CoapShortStructure.HeadPacket.ProtocolType				= 0x00;
	CoapShortStructure.HeadPacket.Reserved1					= 0x00;
	CoapShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	CoapShortStructure.HeadPacket.Reserved2					= 0x00;
	CoapShortStructure.HeadPacket.PacketType				= 0x05;
	CoapShortStructure.HeadPacket.PacketNumber				= 0x00;
	CoapShortStructure.MsgPacket.DestSN					= 0x00;
	CoapShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CoapLongStructureInit(void)
{
	CoapLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CoapLongStructure.HeadPacket.DataLen					= 0x00;
	CoapLongStructure.HeadPacket.ProtocolType				= 0x00;
	CoapLongStructure.HeadPacket.Reserved1					= 0x00;
	CoapLongStructure.HeadPacket.ProtocolVersion				= 0x00;
	CoapLongStructure.HeadPacket.Reserved2					= 0x00;
	CoapLongStructure.HeadPacket.PacketType					= 0x05;
	CoapLongStructure.HeadPacket.PacketNumber				= 0x00;
	CoapLongStructure.MsgPacket.DestSN						= 0x00;
#if NBIOT_STATUS_MSG_VERSION_TYPE == NBIOT_STATUS_MSG_VERSION_33BYTE_V1
	CoapLongStructure.MsgPacket.Version					= 0x01;
#elif NBIOT_STATUS_MSG_VERSION_TYPE == NBIOT_STATUS_MSG_VERSION_77BYTE_V2
	CoapLongStructure.MsgPacket.Version					= 0x02;
#endif
}

